<a href="https://colab.research.google.com/github/newbiepawel/Hello-Github/blob/master/Kategoryzacja_LuxMed.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Kategoryzacja (grupowanie) automatyczne kontrahentów* na podstawie 3 miar:
ARPU
Szkodowość
Marża %
W ostatnim kwartale, półroczu, roku (3, 6, 12 miesięcy wstecz od wskazanego miesiąca). Wyniki przedstawione w formie raportu/wizualizacji.

*Kontrahenci bez grupy kapitałowej na poziomie kontrahenta, kontrahenci z przypisanymi grupami kapitałowymi na poziomie grupy.

Tworzenie tabeli ARPU3 gdzie będą wartości średniej ruchomej z okresu 3 miesiący dla ARPU po grupie kapitałowej

In [ ]:
ARPU3 = fakty[(fakty['LINE_ID']==25672)& (fakty['DT_GRUPA_KAPITALOWA_ID'] !=0)].groupby(['DT_GRUPA_KAPITALOWA_ID', 'PER_ID'])['VALUE'].sum()/\
fakty[(fakty['LINE_ID'] == 25664) &(fakty['DT_GRUPA_KAPITALOWA_ID']!=0)].groupby(['DT_GRUPA_KAPITALOWA_ID', 'PER_ID'])['VALUE'].sum().rolling(3).mean()
ARPU3 = pd.DataFrame(ARPU3)
ARPU3.reset_index(inplace=True)
ARPU3.head()

   DT_GRUPA_KAPITALOWA_ID  PER_ID  VALUE
0                     202  201201    NaN
1                     202  201202    NaN
2                     202  201203   77.8
3                     202  201204   73.6
4                     202  201205   72.8

sprawdzanie wartości infinity

In [ ]:
ARPU3.max(), ARPU3.min()

(DT_GRUPA_KAPITALOWA_ID      1382.0
 PER_ID                    201509.0
 VALUE                          inf
 dtype: float64, DT_GRUPA_KAPITALOWA_ID       202.0
 PER_ID                    201201.0
 VALUE                         -inf
 dtype: float64)

Przypisanie wartościom infinity zera

In [ ]:
ARPU3['VALUE'][ARPU3['VALUE'] == ARPU3['VALUE'].min()] = 0
ARPU3['VALUE'][ARPU3['VALUE'] == ARPU3['VALUE'].max()] = 0

In [ ]:
ARPU3.isnull().sum()

DT_GRUPA_KAPITALOWA_ID       0
PER_ID                       0
VALUE                     2584
dtype: int64

Przypisanie wartościom NULL zera

In [ ]:
ARPU3.fillna(0, inplace = True)

Zostawienie w tabeli fakty tylko niezbędnych wartości

In [ ]:
fakty = fakty[['PER_ID', 'LINE_ID', 'DT_GRUPA_KAPITALOWA_ID', 'DT_CUST_ID',	'VALUE', 'ARPU',	'Szkodowosc',	'marza']]

Stworzenie klucza(data+grupa kapitałowa), po którym uzupełnię tabelę fakty wartościami z tabeli ARPU3, tym razem nie można połączyć tylko po grupie kapitałowej czy customer id gdyż wartość  opiera się również na dacie

In [ ]:
fakty['key'] = fakty['PER_ID'].astype(str)+ fakty['DT_GRUPA_KAPITALOWA_ID'].astype(str)
fakty.sample(5)

        PER_ID  LINE_ID  ...      marza         key
580023  201301    25667  ...     1820.0   201301729
154334  201201    25664  ...  1283940.0  2012011150
129300  201205    25666  ...    63810.0   201205354
908474  201202    25664  ...    17600.0   201202702
12358   201201    25668  ...    18860.0   201201920

[5 rows x 9 columns]

Tak samo stworzenie klucza dla tabeli ARPU3

In [ ]:
ARPU3['key'] = ARPU3['PER_ID'].astype(str)+ ARPU3['DT_GRUPA_KAPITALOWA_ID'].astype(str)
ARPU3.head()

   DT_GRUPA_KAPITALOWA_ID  PER_ID  VALUE        key
0                     202  201201    0.0  201201202
1                     202  201202    0.0  201202202
2                     202  201203   77.8  201203202
3                     202  201204   73.6  201204202
4                     202  201205   72.8  201205202

Uzupełnienie tabeli fakty wartościami z tabeli ARPU3 po kluczu

In [ ]:
fakty = fakty.merge(ARPU3[['VALUE', 'key']], on = 'key', how = 'left')
fakty.rename(columns={"VALUE_x": "VALUE", "VALUE_y": "ARPU3"}, inplace=True)

fakty.sample(5)

        PER_ID  LINE_ID  ...        key       ARPU3
632933  201308    25667  ...  201308715   27.541568
293320  201204    25666  ...  201204940    3.535795
639212  201201    25667  ...  201201664  166.500000
72338   201208    25668  ...  201208829         NaN
189280  201301    25667  ...  201301516   28.883721

[5 rows x 10 columns]

In [ ]:
fakty['ARPU3'].fillna(0, inplace = True)

Tworzenie tabeli ARPU3_ gdzie będą wartości średniej ruchomej z okresu 3 miesiący dla ARPU po DT_CUST_ID(gdzie brak grupy kapitałowej)

In [ ]:
ARPU3_ = fakty[(fakty['LINE_ID']==25672)& (fakty['DT_GRUPA_KAPITALOWA_ID'] ==0)].groupby(['DT_CUST_ID', 'PER_ID'])['VALUE'].sum()/\
fakty[(fakty['LINE_ID'] == 25664) &(fakty['DT_GRUPA_KAPITALOWA_ID']==0)].groupby(['DT_CUST_ID', 'PER_ID'])['VALUE'].sum().rolling(3).mean()
ARPU3_ = pd.DataFrame(ARPU3_)
ARPU3_.reset_index(inplace=True)
ARPU3_.head()

   DT_CUST_ID  PER_ID  VALUE
0           0  201201    NaN
1           0  201202    NaN
2           0  201203    NaN
3           0  201204    NaN
4           0  201205    NaN

In [ ]:
ARPU3_.max(), ARPU3_.min()

(DT_CUST_ID     82085.0
 PER_ID        201509.0
 VALUE              inf
 dtype: float64, DT_CUST_ID         0.0
 PER_ID        201201.0
 VALUE             70.5
 dtype: float64)

In [ ]:
ARPU3_['VALUE'][ARPU3_['VALUE'] == ARPU3_['VALUE'].max()] = 0

In [ ]:
ARPU3_.fillna(0, inplace = True)

Stworzenie kolejnego(osobnego) klucza by uzupełniać dane z tabeli po DT_CUST_ID

In [ ]:
fakty['key_'] = fakty['PER_ID'].astype(str)+ fakty['DT_CUST_ID'].astype(str)
fakty.sample(5)

        PER_ID  LINE_ID  ...       ARPU3         key_
140755  201301    25667  ...   44.571429  20130120268
183664  201204    25664  ...   28.812500  20120423101
817834  201407    25664  ...    0.000000  20140742433
40207   201201    25666  ...  203.400000    201201938
677758  201205    25672  ...    0.000000  20120538483

[5 rows x 11 columns]

In [ ]:
ARPU3_['key_'] = ARPU3_['PER_ID'].astype(str)+ ARPU3_['DT_CUST_ID'].astype(str)
ARPU3_.head()

   DT_CUST_ID  PER_ID  VALUE     key_
0           0  201201    0.0  2012010
1           0  201202    0.0  2012020
2           0  201203    0.0  2012030
3           0  201204    0.0  2012040
4           0  201205    0.0  2012050

In [ ]:
fakty = fakty.merge(ARPU3_[['VALUE', 'key_']], on = 'key_', how = 'left')
fakty.rename(columns={"VALUE_x": "VALUE", "VALUE_y": "ARPU3_"}, inplace=True)

fakty.sample(5)

         PER_ID  LINE_ID  ...         key_  ARPU3_
459208   201204    25672  ...  20120432464     NaN
849524   201301    25666  ...  20130145033     NaN
995151   201509    25664  ...  20150954095     NaN
134513   201206    25667  ...  20120620135     NaN
1045627  201509    25667  ...  20150984163     NaN

[5 rows x 12 columns]

In [ ]:
fakty['ARPU3_'].fillna(0, inplace = True)

Stworzenie kolumny ARPU_3_mies na podstawie ARPU3(po grupie kapitałowej) i ARPU3_(po DT_CUST_ID)

In [ ]:
fakty['ARPU_3_mies'] = fakty['ARPU3'] + fakty['ARPU3_']
fakty.drop(['ARPU3', 'ARPU3_'], axis = 1, inplace = True)
# Zastąpienie wartośći ARPU_3_mies gdzie brak średniej z 3 okresów poprostu wartościami ARPU
fakty['ARPU_3_mies'][fakty['ARPU_3_mies']==0] = fakty[fakty['ARPU_3_mies']==0]['ARPU']
fakty.sample(10)

         PER_ID  LINE_ID  ...         key_  ARPU_3_mies
863339   201207    25664  ...  20120745416    24.426586
712768   201409    25668  ...  20140938782    24.426586
106199   201201    25672  ...   2012012086    13.736842
548466   201301    25667  ...  20130135369    33.278146
974802   201301    25672  ...  20130152172    30.418269
824320   201308    25667  ...  20130842905    15.586286
13713    201203    25666  ...    201203691    35.216912
934183   201206    25668  ...  20120650281    26.698396
1046708  201509    25668  ...  20150985306    23.900000
135960   201308    25666  ...  20130820135    43.869863

[10 rows x 11 columns]

Tworzenie tabeli z ARPU ze średnią ruchomą(z ostatnich 6 miesięcy) po grupie kapitałowej

In [ ]:
ARPU6 = fakty[(fakty['LINE_ID']==25672)& (fakty['DT_GRUPA_KAPITALOWA_ID'] !=0)].groupby(['DT_GRUPA_KAPITALOWA_ID', 'PER_ID'])['VALUE'].sum()/\
fakty[(fakty['LINE_ID'] == 25664) &(fakty['DT_GRUPA_KAPITALOWA_ID']!=0)].groupby(['DT_GRUPA_KAPITALOWA_ID', 'PER_ID'])['VALUE'].sum().rolling(6).mean()
ARPU6 = pd.DataFrame(ARPU6)
ARPU6.reset_index(inplace=True)
ARPU6.head()

   DT_GRUPA_KAPITALOWA_ID  PER_ID  VALUE
0                     202  201201    NaN
1                     202  201202    NaN
2                     202  201203    NaN
3                     202  201204    NaN
4                     202  201205    NaN

In [ ]:
ARPU6.max(), ARPU6.min()

In [ ]:
ARPU6['VALUE'][ARPU6['VALUE'] == ARPU6['VALUE'].max()] = 0

In [ ]:
ARPU6.fillna(0, inplace = True)

In [ ]:
ARPU6['key'] = ARPU6['PER_ID'].astype(str)+ ARPU6['DT_GRUPA_KAPITALOWA_ID'].astype(str)
ARPU6.head()

   DT_GRUPA_KAPITALOWA_ID  PER_ID  VALUE        key
0                     202  201201    0.0  201201202
1                     202  201202    0.0  201202202
2                     202  201203    0.0  201203202
3                     202  201204    0.0  201204202
4                     202  201205    0.0  201205202

In [ ]:
fakty = fakty.merge(ARPU6[['VALUE', 'key']], on = 'key', how = 'left')
fakty.rename(columns={"VALUE_x": "VALUE", "VALUE_y": "ARPU6"}, inplace=True)

fakty.sample(5)

         PER_ID  LINE_ID  ...  ARPU_3_mies       ARPU6
819822   201201    25667  ...   104.594595  209.189189
836601   201205    25666  ...    36.900000   44.280000
155183   201407    25666  ...    82.153846    0.000000
90099    201207    25668  ...    26.698396    0.000000
1027701  201308    25668  ...     2.088146    2.592453

[5 rows x 12 columns]

In [ ]:
fakty['ARPU6'].fillna(0, inplace = True)
fakty.isnull().sum()

PER_ID                    0
LINE_ID                   0
DT_GRUPA_KAPITALOWA_ID    0
DT_CUST_ID                0
VALUE                     0
ARPU                      0
Szkodowosc                0
marza                     0
key                       0
key_                      0
ARPU_3_mies               0
ARPU6                     0
dtype: int64

Tworzenie tabeli z ARPU ze średnią ruchomą(z ostatnich 6 miesięcy) po grupie DT_CUST_ID

In [ ]:
ARPU6_ = fakty[(fakty['LINE_ID']==25672)& (fakty['DT_GRUPA_KAPITALOWA_ID'] ==0)].groupby(['DT_CUST_ID', 'PER_ID'])['VALUE'].sum()/\
fakty[(fakty['LINE_ID'] == 25664) &(fakty['DT_GRUPA_KAPITALOWA_ID']==0)].groupby(['DT_CUST_ID', 'PER_ID'])['VALUE'].sum().rolling(6).mean()
ARPU6_ = pd.DataFrame(ARPU6_)
ARPU6_.reset_index(inplace=True)
ARPU6_.head()

   DT_CUST_ID  PER_ID  VALUE
0           0  201201    NaN
1           0  201202    NaN
2           0  201203    NaN
3           0  201204    NaN
4           0  201205    NaN

In [ ]:
ARPU6_.max(), ARPU6_.min()

In [ ]:
ARPU6_.fillna(0, inplace = True)

In [ ]:
ARPU6_['key_'] = ARPU6_['PER_ID'].astype(str)+ ARPU6_['DT_CUST_ID'].astype(str)
ARPU6_.head()

   DT_CUST_ID  PER_ID  VALUE     key_
0           0  201201    0.0  2012010
1           0  201202    0.0  2012020
2           0  201203    0.0  2012030
3           0  201204    0.0  2012040
4           0  201205    0.0  2012050

In [ ]:
fakty = fakty.merge(ARPU6_[['VALUE', 'key_']], on = 'key_', how = 'left')
fakty.rename(columns={"VALUE_x": "VALUE", "VALUE_y": "ARPU6_"}, inplace=True)

fakty.sample(5)

        PER_ID  LINE_ID  DT_GRUPA_KAPITALOWA_ID  ...  ARPU_3_mies      ARPU6  ARPU6_
441762  201207    25666                     307  ...    25.449462   0.000000     NaN
150282  201202    25668                     388  ...    40.125000  80.250000     NaN
375485  201211    25666                     248  ...     6.882849   0.000000     NaN
324220  201509    25667                     785  ...    64.285714   0.995575     NaN
706085  201211    25667                    1059  ...    24.426586   0.000000     NaN

[5 rows x 13 columns]

In [ ]:
fakty['ARPU6_'].fillna(0, inplace = True)

In [ ]:
fakty['ARPU_6_mies'] = fakty['ARPU6'] + fakty['ARPU6_']
fakty.drop(['ARPU6', 'ARPU6_'], axis = 1, inplace = True)
# Zastąpienie wartośći ARPU_6_mies gdzie brak średniej z 6 okresów poprostu wartościami ARPU
fakty['ARPU_6_mies'][fakty['ARPU_6_mies']==0] = fakty[fakty['ARPU_6_mies']==0]['ARPU']
fakty.sample(10)

         PER_ID  LINE_ID  ...  ARPU_3_mies  ARPU_6_mies
578932   201202    25668  ...    92.000000   184.000000
855657   201201    25668  ...    86.551640   170.004773
183604   201204    25668  ...    28.812500    40.086957
1007460  201407    25667  ...    26.698396    26.698396
524391   201201    25672  ...    59.691358   116.975806
737621   201509    25667  ...    15.822581    15.696000
851221   201211    25664  ...    26.698396    26.698396
884339   201301    25668  ...    51.000000    51.000000
671058   201509    25666  ...    29.398329    34.546645
910932   201207    25666  ...    26.698396    26.698396

[10 rows x 12 columns]

Tworzenie tabeli z ARPU ze średnią ruchomą(z ostatnich 12 miesięcy) po grupie grupie kapitałowej

In [ ]:
ARPU12 = fakty[(fakty['LINE_ID']==25672)& (fakty['DT_GRUPA_KAPITALOWA_ID'] !=0)].groupby(['DT_GRUPA_KAPITALOWA_ID', 'PER_ID'])['VALUE'].sum()/\
fakty[(fakty['LINE_ID'] == 25664) &(fakty['DT_GRUPA_KAPITALOWA_ID']!=0)].groupby(['DT_GRUPA_KAPITALOWA_ID', 'PER_ID'])['VALUE'].sum().rolling(12).mean()
ARPU12 = pd.DataFrame(ARPU12)
ARPU12.reset_index(inplace=True)
ARPU12.head()

   DT_GRUPA_KAPITALOWA_ID  PER_ID  VALUE
0                     202  201201    NaN
1                     202  201202    NaN
2                     202  201203    NaN
3                     202  201204    NaN
4                     202  201205    NaN

In [ ]:
ARPU12.max(), ARPU12.min()

In [ ]:
ARPU12['VALUE'][ARPU12['VALUE'] == ARPU12['VALUE'].max()] = 0

In [ ]:
ARPU12.fillna(0, inplace = True)

In [ ]:
ARPU12['key'] = ARPU12['PER_ID'].astype(str)+ ARPU12['DT_GRUPA_KAPITALOWA_ID'].astype(str)
ARPU12.head()

   DT_GRUPA_KAPITALOWA_ID  PER_ID  VALUE        key
0                     202  201201    0.0  201201202
1                     202  201202    0.0  201202202
2                     202  201203    0.0  201203202
3                     202  201204    0.0  201204202
4                     202  201205    0.0  201205202

In [ ]:
fakty = fakty.merge(ARPU12[['VALUE', 'key']], on = 'key', how = 'left')
fakty.rename(columns={"VALUE_x": "VALUE", "VALUE_y": "ARPU12"}, inplace=True)

fakty.sample(5)

        PER_ID  LINE_ID  ...  ARPU_6_mies      ARPU12
42825   201201    25664  ...   124.239521  178.094421
823159  201509    25668  ...   102.827586  165.666667
414605  201509    25666  ...    31.311111   35.151767
788581  201204    25668  ...    22.156536   42.238095
467835  201203    25666  ...    48.737487   97.474974

[5 rows x 13 columns]

In [ ]:
fakty['ARPU12'].fillna(0, inplace = True)

Tworzenie tabeli z ARPU ze średnią ruchomą(z ostatnich 12 miesięcy) po grupie DT_CUST_ID

In [ ]:
ARPU12_ = fakty[(fakty['LINE_ID']==25672)& (fakty['DT_GRUPA_KAPITALOWA_ID'] ==0)].groupby(['DT_CUST_ID', 'PER_ID'])['VALUE'].sum()/\
fakty[(fakty['LINE_ID'] == 25664) &(fakty['DT_GRUPA_KAPITALOWA_ID']==0)].groupby(['DT_CUST_ID', 'PER_ID'])['VALUE'].sum().rolling(3).mean()
ARPU12_ = pd.DataFrame(ARPU12_)
ARPU12_.reset_index(inplace=True)
ARPU12_.head()

   DT_CUST_ID  PER_ID  VALUE
0           0  201201    NaN
1           0  201202    NaN
2           0  201203    NaN
3           0  201204    NaN
4           0  201205    NaN

In [ ]:
ARPU12_.max(), ARPU12_.min()

In [ ]:
ARPU12_['VALUE'][ARPU12_['VALUE'] == ARPU12_['VALUE'].max()] = 0

In [ ]:
ARPU12_.fillna(0, inplace = True)

In [ ]:
ARPU12_['key_'] = ARPU3_['PER_ID'].astype(str)+ ARPU12_['DT_CUST_ID'].astype(str)
ARPU12_.head()

   DT_CUST_ID  PER_ID  VALUE     key_
0           0  201201    0.0  2012010
1           0  201202    0.0  2012020
2           0  201203    0.0  2012030
3           0  201204    0.0  2012040
4           0  201205    0.0  2012050

In [ ]:
fakty = fakty.merge(ARPU12_[['VALUE', 'key_']], on = 'key_', how = 'left')
fakty.rename(columns={"VALUE_x": "VALUE", "VALUE_y": "ARPU12_"}, inplace=True)

fakty.sample(5)

        PER_ID  LINE_ID  ...      ARPU12  ARPU12_
822174  201409    25668  ...    0.000000      NaN
479131  201207    25668  ...    0.000000      NaN
119028  201203    25668  ...   75.761905      NaN
889704  201201    25666  ...  144.955224      NaN
581683  201201    25668  ...  286.909091      NaN

[5 rows x 14 columns]

In [ ]:
fakty['ARPU12_'].fillna(0, inplace = True)

In [ ]:
fakty['ARPU_12_mies'] = fakty['ARPU12'] + fakty['ARPU12_']
fakty.drop(['ARPU12', 'ARPU12_'], axis = 1, inplace = True)
# Zastąpienie wartośći ARPU_12_mies gdzie brak średniej z 12 okresów poprostu wartościami ARPU
fakty['ARPU_12_mies'][fakty['ARPU_12_mies']==0] = fakty[fakty['ARPU_12_mies']==0]['ARPU']
fakty.sample(10)

        PER_ID  LINE_ID  ...  ARPU_6_mies  ARPU_12_mies
340890  201202    25666  ...   104.262857    208.525714
481186  201207    25667  ...    18.895603     18.895603
180008  201407    25667  ...    32.784452     32.784452
398169  201201    25666  ...   161.052632    284.651163
342621  201205    25672  ...    41.497738     82.995475
141339  201204    25672  ...    90.750000    181.500000
692619  201201    25666  ...   170.004773    340.009547
941270  201308    25668  ...     8.350183     11.220345
89746   201201    25666  ...   174.325095    348.650190
437918  201204    25666  ...    47.706202     83.908134

[10 rows x 13 columns]

In [ ]:
fakty.head()

   PER_ID  LINE_ID  ...  ARPU_12_mies  Szkodowosc3_
0  201201    25664  ...           0.0           0.0
1  201201    25664  ...           0.0           0.0
2  201202    25664  ...           0.0           0.0
3  201203    25664  ...           0.0           0.0
4  201204    25664  ...           0.0           0.0

[5 rows x 14 columns]

Tworzenie tabeli z Szkodowosc ze średnią ruchomą(z ostatnich 3 miesięcy) po grupie kapitałowej

In [ ]:
Szkodowosc3 = fakty[(fakty['LINE_ID']==25666)& (fakty['DT_GRUPA_KAPITALOWA_ID'] !=0)].groupby(['DT_GRUPA_KAPITALOWA_ID', 'PER_ID'])['VALUE'].sum()/\
fakty[(fakty['LINE_ID'] == 25664) &(fakty['DT_GRUPA_KAPITALOWA_ID']!=0)].groupby(['DT_GRUPA_KAPITALOWA_ID', 'PER_ID'])['VALUE'].sum().rolling(3).mean()
Szkodowosc3 = pd.DataFrame(Szkodowosc3)
Szkodowosc3.reset_index(inplace=True)
Szkodowosc3.head()

   DT_GRUPA_KAPITALOWA_ID  PER_ID  VALUE
0                     202  201201    NaN
1                     202  201202    NaN
2                     202  201203    0.4
3                     202  201204    1.0
4                     202  201205    0.0

In [ ]:
Szkodowosc3.max(), Szkodowosc3.min()

(DT_GRUPA_KAPITALOWA_ID      1382.0
 PER_ID                    201603.0
 VALUE                          inf
 dtype: float64, DT_GRUPA_KAPITALOWA_ID       202.0
 PER_ID                    201201.0
 VALUE                          0.0
 dtype: float64)

In [ ]:
Szkodowosc3['VALUE'][Szkodowosc3['VALUE'] == Szkodowosc3['VALUE'].max()] = 0

In [ ]:
Szkodowosc3.fillna(0, inplace = True)

In [ ]:
Szkodowosc3['key'] = Szkodowosc3['PER_ID'].astype(str)+ Szkodowosc3['DT_GRUPA_KAPITALOWA_ID'].astype(str)
Szkodowosc3.head()

   DT_GRUPA_KAPITALOWA_ID  PER_ID  VALUE        key
0                     202  201201    0.0  201201202
1                     202  201202    0.0  201202202
2                     202  201203    0.4  201203202
3                     202  201204    1.0  201204202
4                     202  201205    0.0  201205202

In [ ]:
fakty = fakty.merge(Szkodowosc3[['VALUE', 'key']], on = 'key', how = 'left')
fakty.rename(columns={"VALUE_x": "VALUE", "VALUE_y": "Szkodowosc3"}, inplace=True)

fakty.sample(5)

        PER_ID  LINE_ID  ...  Szkodowosc3_  Szkodowosc3
803181  201301    25667  ...           NaN     0.696970
579178  201205    25667  ...           NaN    12.818182
927467  201206    25667  ...           NaN          NaN
53345   201509    25666  ...           NaN     0.846154
764078  201201    25664  ...           NaN     1.897485

[5 rows x 15 columns]

In [ ]:
fakty['Szkodowosc3'].fillna(0, inplace = True)

Tworzenie tabeli z Szkodowosc ze średnią ruchomą(z ostatnich 3 miesięcy) po grupie DT_CUST_ID

In [ ]:
Szkodowosc3_ = fakty[(fakty['LINE_ID']==25666)& (fakty['DT_GRUPA_KAPITALOWA_ID'] ==0)].groupby(['DT_CUST_ID', 'PER_ID'])['VALUE'].sum()/\
fakty[(fakty['LINE_ID'] == 25664) &(fakty['DT_GRUPA_KAPITALOWA_ID']==0)].groupby(['DT_CUST_ID', 'PER_ID'])['VALUE'].sum().rolling(3).mean()
Szkodowosc3_ = pd.DataFrame(Szkodowosc3_)
Szkodowosc3_.reset_index(inplace=True)
Szkodowosc3_.head()

   DT_CUST_ID  PER_ID  VALUE
0           0  201201    NaN
1           0  201202    NaN
2           0  201203    NaN
3           0  201204    NaN
4           0  201205    NaN

In [ ]:
Szkodowosc3_.max(), Szkodowosc3_.min()

(DT_CUST_ID     82085.0
 PER_ID        201509.0
 VALUE              inf
 dtype: float64, DT_CUST_ID         0.0
 PER_ID        201201.0
 VALUE              0.0
 dtype: float64)

In [ ]:
Szkodowosc3_['VALUE'][Szkodowosc3_['VALUE'] == Szkodowosc3_['VALUE'].max()] = 0

In [ ]:
Szkodowosc3_.fillna(0, inplace = True)

In [ ]:
Szkodowosc3_['key_'] = Szkodowosc3_['PER_ID'].astype(str)+ Szkodowosc3_['DT_CUST_ID'].astype(str)
Szkodowosc3_.head()

   DT_CUST_ID  PER_ID  VALUE     key_
0           0  201201    0.0  2012010
1           0  201202    0.0  2012020
2           0  201203    0.0  2012030
3           0  201204    0.0  2012040
4           0  201205    0.0  2012050

In [ ]:
fakty = fakty.merge(Szkodowosc3_[['VALUE', 'key_']], on = 'key_', how = 'left')
fakty.rename(columns={"VALUE_x": "VALUE", "VALUE_y": "Szkodowosc3_"}, inplace=True)

fakty.sample(5)

         PER_ID  LINE_ID  ...  Szkodowosc3  Szkodowosc3_
1040370  201509    25667  ...     1.176225           NaN
615562   201308    25668  ...     0.455643           NaN
690034   201204    25668  ...     1.273099           NaN
377746   201509    25668  ...     0.312115           NaN
453902   201211    25664  ...     0.272727           NaN

[5 rows x 16 columns]

In [ ]:
fakty['Szkodowosc3_'].fillna(0, inplace = True)

In [ ]:
fakty.isnull().sum()

PER_ID                    0
LINE_ID                   0
DT_GRUPA_KAPITALOWA_ID    0
DT_CUST_ID                0
VALUE                     0
ARPU                      0
Szkodowosc                0
marza                     0
key                       0
key_                      0
ARPU_3_mies               0
ARPU_6_mies               0
ARPU_12_mies              0
Szkodowosc3_              0
Szkodowosc3               0
dtype: int64

In [ ]:
fakty['Szkodowosc_3_mies'] = fakty['Szkodowosc3'] + fakty['Szkodowosc3_']
fakty.drop(['Szkodowosc3', 'Szkodowosc3_'], axis = 1, inplace = True)
# Zastąpienie wartośći Szkodowosc_3_mies gdzie brak średniej z 3 okresów poprostu wartościami Szkodowosc
fakty['Szkodowosc_3_mies'][fakty['Szkodowosc_3_mies']==0] = fakty[fakty['Szkodowosc_3_mies']==0]['Szkodowosc']
fakty.sample(10)

        PER_ID  LINE_ID  ...  ARPU_12_mies  Szkodowosc_3_mies
276084  201206    25672  ...     41.055556           0.500000
653841  201407    25666  ...     23.197107           1.408537
912741  201205    25667  ...    132.000000           0.818182
77941   201205    25664  ...     60.729927           1.350101
970865  201203    25667  ...    129.401060           0.878981
709307  201308    25668  ...     37.141976           0.931537
936409  201306    25668  ...     37.514110           1.418405
928210  201308    25667  ...     50.200000           0.775385
633414  201407    25668  ...     19.239468           0.474820
561489  201301    25668  ...     56.118959           0.795918

[10 rows x 14 columns]

Tworzenie tabeli z ARPU ze średnią ruchomą(z ostatnich  miesięcy) po grupie grupie kapitałowej

In [ ]:
Szkodowosc6 = fakty[(fakty['LINE_ID']==25666)& (fakty['DT_GRUPA_KAPITALOWA_ID'] !=0)].groupby(['DT_GRUPA_KAPITALOWA_ID', 'PER_ID'])['VALUE'].sum()/\
fakty[(fakty['LINE_ID'] == 25664) &(fakty['DT_GRUPA_KAPITALOWA_ID']!=0)].groupby(['DT_GRUPA_KAPITALOWA_ID', 'PER_ID'])['VALUE'].sum().rolling(6).mean()
Szkodowosc6 = pd.DataFrame(Szkodowosc6)
Szkodowosc6.reset_index(inplace=True)
Szkodowosc6.head()

   DT_GRUPA_KAPITALOWA_ID  PER_ID  VALUE
0                     202  201201    NaN
1                     202  201202    NaN
2                     202  201203    NaN
3                     202  201204    NaN
4                     202  201205    NaN

In [ ]:
Szkodowosc6.max(), Szkodowosc6.min()

(DT_GRUPA_KAPITALOWA_ID      1382.0
 PER_ID                    201603.0
 VALUE                          inf
 dtype: float64, DT_GRUPA_KAPITALOWA_ID       202.0
 PER_ID                    201201.0
 VALUE                          0.0
 dtype: float64)

In [ ]:
Szkodowosc6['VALUE'][Szkodowosc6['VALUE'] == Szkodowosc6['VALUE'].max()] = 0

In [ ]:
Szkodowosc6.fillna(0, inplace = True)

Szkodowosc6['key'] = Szkodowosc6['PER_ID'].astype(str)+ Szkodowosc6['DT_GRUPA_KAPITALOWA_ID'].astype(str)

fakty = fakty.merge(Szkodowosc6[['VALUE', 'key']], on = 'key', how = 'left')
fakty.rename(columns={"VALUE_x": "VALUE", "VALUE_y": "Szkodowosc6"}, inplace=True)

fakty.sample(5)

        PER_ID  LINE_ID  ...  Szkodowosc_3_mies  Szkodowosc6
579065  201204    25666  ...          12.300000    18.923077
355271  201203    25672  ...           1.339286     2.678571
719871  201205    25666  ...           0.857143     0.972973
161717  201201    25667  ...           1.897485     3.730038
611591  201205    25667  ...           0.274042     0.330000

[5 rows x 15 columns]

In [ ]:
fakty['Szkodowosc6'].fillna(0, inplace = True)

Tworzenie tabeli z Szkodowosc ze średnią ruchomą(z ostatnich 6 miesięcy) po DT_CUST_ID

In [ ]:
Szkodowosc6_ = fakty[(fakty['LINE_ID']==25666)& (fakty['DT_GRUPA_KAPITALOWA_ID'] ==0)].groupby(['DT_CUST_ID', 'PER_ID'])['VALUE'].sum()/\
fakty[(fakty['LINE_ID'] == 25664) &(fakty['DT_GRUPA_KAPITALOWA_ID']==0)].groupby(['DT_CUST_ID', 'PER_ID'])['VALUE'].sum().rolling(6).mean()
Szkodowosc6_ = pd.DataFrame(Szkodowosc6_)
Szkodowosc6_.reset_index(inplace=True)
Szkodowosc6_.head()

   DT_CUST_ID  PER_ID  VALUE
0           0  201201    NaN
1           0  201202    NaN
2           0  201203    NaN
3           0  201204    NaN
4           0  201205    NaN

In [ ]:
Szkodowosc6_.max(), Szkodowosc3_.min()

(DT_CUST_ID     82085.0
 PER_ID        201509.0
 VALUE              inf
 dtype: float64, DT_CUST_ID          0.0
 PER_ID         201201.0
 VALUE               0.0
 key_          2012010.0
 dtype: float64)

In [ ]:
Szkodowosc6_['VALUE'][Szkodowosc6_['VALUE'] == Szkodowosc6_['VALUE'].max()] = 0

In [ ]:
Szkodowosc6_.fillna(0, inplace = True)

In [ ]:
Szkodowosc6_['key_'] = Szkodowosc6_['PER_ID'].astype(str)+ Szkodowosc6_['DT_CUST_ID'].astype(str)
fakty = fakty.merge(Szkodowosc6_[['VALUE', 'key_']], on = 'key_', how = 'left')
fakty.rename(columns={"VALUE_x": "VALUE", "VALUE_y": "Szkodowosc6_"}, inplace=True)
fakty['Szkodowosc6_'].fillna(0, inplace = True)
fakty.sample(5)

        PER_ID  LINE_ID  ...  Szkodowosc6  Szkodowosc6_
579145  201205    25666  ...    16.588235           0.0
727880  201308    25672  ...     0.904568           0.0
663850  201509    25672  ...     0.201183           0.0
721380  201203    25672  ...     2.666667           0.0
564154  201205    25667  ...     1.090802           0.0

[5 rows x 16 columns]

In [ ]:
fakty['Szkodowosc_6_mies'] = fakty['Szkodowosc6'] + fakty['Szkodowosc6_']
fakty.drop(['Szkodowosc6', 'Szkodowosc6_'], axis = 1, inplace = True)
# Zastąpienie wartośći Szkodowosc_3_mies gdzie brak średniej z 3 okresów poprostu wartościami Szkodowosc
fakty['Szkodowosc_6_mies'][fakty['Szkodowosc_6_mies']==0] = fakty[fakty['Szkodowosc_6_mies']==0]['Szkodowosc']
fakty.sample(10)

        PER_ID  LINE_ID  ...  Szkodowosc_3_mies  Szkodowosc_6_mies
886782  201207    25668  ...           0.757262           0.739364
661994  201206    25672  ...           0.149611           0.149611
707092  201301    25666  ...           1.157623           1.129175
647388  201202    25667  ...           1.050000           2.100000
60199   201207    25667  ...           1.714286           2.400000
438255  201204    25666  ...           0.751105           1.109902
953854  201409    25668  ...           0.874308           0.874308
906037  201308    25666  ...           0.284483           0.356757
779097  201407    25668  ...           0.267568           0.272446
749766  201208    25668  ...           1.339089           1.339089

[10 rows x 15 columns]

Tworzenie tabeli szkodowosc ze średnią ruchomą(z ostatnich 12 miesięcy) po grupie kapitałowej

In [ ]:
Szkodowosc12 = fakty[(fakty['LINE_ID']==25666)& (fakty['DT_GRUPA_KAPITALOWA_ID'] !=0)].groupby(['DT_GRUPA_KAPITALOWA_ID', 'PER_ID'])['VALUE'].sum()/\
fakty[(fakty['LINE_ID'] == 25664) &(fakty['DT_GRUPA_KAPITALOWA_ID']!=0)].groupby(['DT_GRUPA_KAPITALOWA_ID', 'PER_ID'])['VALUE'].sum().rolling(12).mean()
Szkodowosc12 = pd.DataFrame(Szkodowosc12)
Szkodowosc12.reset_index(inplace=True)
Szkodowosc12.head()

   DT_GRUPA_KAPITALOWA_ID  PER_ID  VALUE
0                     202  201201    NaN
1                     202  201202    NaN
2                     202  201203    NaN
3                     202  201204    NaN
4                     202  201205    NaN

In [ ]:
Szkodowosc12.max(), Szkodowosc12.min()

(DT_GRUPA_KAPITALOWA_ID      1382.0
 PER_ID                    201603.0
 VALUE                          inf
 dtype: float64, DT_GRUPA_KAPITALOWA_ID       202.0
 PER_ID                    201201.0
 VALUE                          0.0
 dtype: float64)

In [ ]:
Szkodowosc12['VALUE'][Szkodowosc12['VALUE'] == Szkodowosc12['VALUE'].max()] = 0
Szkodowosc12.fillna(0, inplace = True)

In [ ]:
Szkodowosc12['key'] = Szkodowosc12['PER_ID'].astype(str)+ Szkodowosc12['DT_GRUPA_KAPITALOWA_ID'].astype(str)
fakty = fakty.merge(Szkodowosc12[['VALUE', 'key']], on = 'key', how = 'left')
fakty.rename(columns={"VALUE_x": "VALUE", "VALUE_y": "Szkodowosc12"}, inplace=True)
fakty['Szkodowosc12'].fillna(0,inplace = True)
fakty.sample(5)

        PER_ID  LINE_ID  ...  Szkodowosc_6_mies  Szkodowosc12
382447  201207    25668  ...           1.333333      2.634146
323394  201201    25667  ...           1.384615      2.769231
348716  201204    25672  ...           0.031746      0.062762
567420  201204    25668  ...           0.458333      0.000000
100456  201205    25664  ...           0.250000      0.000000

[5 rows x 16 columns]

Tworzenie tabeli z Szkodowosc ze średnią ruchomą(z ostatnich 12 miesięcy) po  DT_CUST_ID

In [ ]:
Szkodowosc12_ = fakty[(fakty['LINE_ID']==25666)& (fakty['DT_GRUPA_KAPITALOWA_ID'] ==0)].groupby(['DT_CUST_ID', 'PER_ID'])['VALUE'].sum()/\
fakty[(fakty['LINE_ID'] == 25664) &(fakty['DT_GRUPA_KAPITALOWA_ID']==0)].groupby(['DT_CUST_ID', 'PER_ID'])['VALUE'].sum().rolling(12).mean()
Szkodowosc12_ = pd.DataFrame(Szkodowosc12_)
Szkodowosc12_.reset_index(inplace=True)
Szkodowosc12_.head()

   DT_CUST_ID  PER_ID  VALUE
0           0  201201    NaN
1           0  201202    NaN
2           0  201203    NaN
3           0  201204    NaN
4           0  201205    NaN

In [ ]:
Szkodowosc12_.max(), Szkodowosc12_.min()

(DT_CUST_ID     82085.000000
 PER_ID        201509.000000
 VALUE              2.086957
 dtype: float64, DT_CUST_ID         0.0
 PER_ID        201201.0
 VALUE              0.0
 dtype: float64)

In [ ]:
Szkodowosc12_.fillna(0, inplace = True)
Szkodowosc12_['key_'] = Szkodowosc12_['PER_ID'].astype(str)+ Szkodowosc12_['DT_CUST_ID'].astype(str)
Szkodowosc3_.head()
fakty = fakty.merge(Szkodowosc12_[['VALUE', 'key_']], on = 'key_', how = 'left')
fakty.rename(columns={"VALUE_x": "VALUE", "VALUE_y": "Szkodowosc12_"}, inplace=True)
fakty['Szkodowosc12_'].fillna(0, inplace = True)
fakty.sample(5)

         PER_ID  LINE_ID  ...  Szkodowosc12  Szkodowosc12_
1024368  201407    25664  ...      2.018227            0.0
724768   201204    25664  ...      3.792935            0.0
954943   201207    25666  ...      1.462282            0.0
419771   201308    25668  ...      0.652720            0.0
211336   201211    25666  ...      0.564972            0.0

[5 rows x 17 columns]

In [ ]:
fakty['Szkodowosc_12_mies'] = fakty['Szkodowosc12'] + fakty['Szkodowosc12_']
fakty.drop(['Szkodowosc12', 'Szkodowosc12_'], axis = 1, inplace = True)
# Zastąpienie wartośći Szkodowosc_12_mies gdzie brak średniej z 12 okresów poprostu wartościami Szkodowosc
fakty['Szkodowosc_12_mies'][fakty['Szkodowosc_12_mies']==0] = fakty[fakty['Szkodowosc_12_mies']==0]['Szkodowosc']
fakty.sample(10)

        PER_ID  LINE_ID  ...  Szkodowosc_6_mies  Szkodowosc_12_mies
403411  201203    25668  ...           1.118343            2.197674
900591  201407    25666  ...           0.840000            1.493333
585167  201301    25667  ...           1.455064            2.172524
182658  201201    25668  ...           6.000000            1.043478
961069  201509    25666  ...           0.888000            0.971979
672994  201301    25672  ...           0.907673            1.365236
694392  201202    25666  ...           3.248039            6.496077
792792  201308    25667  ...           0.904568            1.182341
653274  201308    25666  ...           2.161491            3.012987
90591   201202    25672  ...           8.000000            6.000000

[10 rows x 16 columns]

Tworzenie tabeli marza ze średnią ruchomą(z ostatnich 3 miesięcy) po grupie kapitałowej

In [ ]:
marza3 = fakty[(fakty['LINE_ID']==25672)& (fakty['DT_GRUPA_KAPITALOWA_ID'] !=0)].groupby(['DT_GRUPA_KAPITALOWA_ID', 'PER_ID'])['VALUE'].sum()-\
fakty[(fakty['LINE_ID'] == 25667) &(fakty['DT_GRUPA_KAPITALOWA_ID']!=0)].groupby(['DT_GRUPA_KAPITALOWA_ID', 'PER_ID'])['VALUE'].sum().rolling(3).mean()
marza3 = pd.DataFrame(marza3)
marza3.reset_index(inplace=True)
marza3.head()

   DT_GRUPA_KAPITALOWA_ID  PER_ID        VALUE
0                     202  201201          NaN
1                     202  201202          NaN
2                     202  201203  2720.000000
3                     202  201204  2580.000000
4                     202  201205  2963.333333

In [ ]:
marza3.fillna(0, inplace = True)
marza3['key'] = marza3['PER_ID'].astype(str)+ marza3['DT_GRUPA_KAPITALOWA_ID'].astype(str)
fakty = fakty.merge(marza3[['VALUE', 'key']], on = 'key', how = 'left')
fakty.rename(columns={"VALUE_x": "VALUE", "VALUE_y": "marza3"}, inplace=True)
fakty['marza3'].fillna(0,inplace = True)
fakty.sample(5)

         PER_ID  LINE_ID  ...  Szkodowosc_12_mies        marza3
919353   201203    25667  ...            1.277186     60.000000
1002814  201211    25666  ...            0.780727      0.000000
228789   201301    25667  ...            1.521016  73766.666667
544884   201203    25668  ...            2.280992  11840.000000
399580   201407    25668  ...            0.904918      0.000000

[5 rows x 17 columns]

Tworzenie tabeli marza ze średnią ruchomą(z ostatnich 3 miesięcy) po DT_CUST_ID

In [ ]:
marza3_ = fakty[(fakty['LINE_ID']==25672)& (fakty['DT_GRUPA_KAPITALOWA_ID'] ==0)].groupby(['DT_CUST_ID', 'PER_ID'])['VALUE'].sum()-\
fakty[(fakty['LINE_ID'] == 25667) &(fakty['DT_GRUPA_KAPITALOWA_ID']==0)].groupby(['DT_CUST_ID', 'PER_ID'])['VALUE'].sum().rolling(3).mean()
marza3_ = pd.DataFrame(marza3_)
marza3_.reset_index(inplace=True)
marza3_.head()

   DT_CUST_ID  PER_ID        VALUE
0           0  201308          NaN
1        2451  201201          NaN
2       40093  201509    80.000000
3       44551  201509  1370.000000
4       47830  201201   223.333333

In [ ]:
marza3_.fillna(0, inplace = True)
marza3_['key_'] = marza3_['PER_ID'].astype(str)+ marza3_['DT_CUST_ID'].astype(str)
fakty = fakty.merge(marza3_[['VALUE', 'key_']], on = 'key_', how = 'left')
fakty.rename(columns={"VALUE_x": "VALUE", "VALUE_y": "marza3_"}, inplace=True)
fakty['marza3_'].fillna(0, inplace=True)
fakty.sample(5)

        PER_ID  LINE_ID  ...        marza3  marza3_
601816  201205    25666  ...  19960.000000      0.0
900915  201205    25672  ...  19960.000000      0.0
477841  201206    25667  ...  36866.666667      0.0
979685  201204    25666  ...  22376.666667      0.0
157108  201203    25666  ...   -363.333333      0.0

[5 rows x 18 columns]

In [ ]:
fakty['marza_3_mies'] = fakty['marza3'] + fakty['marza3_']
fakty.drop(['marza3', 'marza3_'], axis = 1, inplace = True)
# Zastąpienie wartośći marza_3_mies gdzie brak średniej z 3 okresów poprostu wartościami marza
fakty['marza_3_mies'][fakty['marza_3_mies']==0] = fakty[fakty['marza_3_mies']==0]['marza']
fakty.sample(10)

        PER_ID  LINE_ID  ...  Szkodowosc_12_mies   marza_3_mies
970285  201201    25666  ...            7.460076  254253.333333
505907  201207    25667  ...            0.685714     710.000000
585497  201201    25666  ...            0.986301    1533.333333
135949  201308    25666  ...            1.096019    7156.666667
109757  201202    25667  ...            0.538462     943.333333
794136  201204    25672  ...            2.165910  151450.000000
309976  201308    25668  ...            1.441253    9766.666667
936929  201201    25668  ...           10.769231   11363.333333
477418  201206    25667  ...            1.285489   36866.666667
284455  201301    25668  ...            0.987881  170013.333333

[10 rows x 17 columns]

Tworzenie marza z ARPU ze średnią ruchomą(z ostatnich 6 miesięcy) po grupie kapitałowej

In [ ]:
marza6 = fakty[(fakty['LINE_ID']==25672)& (fakty['DT_GRUPA_KAPITALOWA_ID'] !=0)].groupby(['DT_GRUPA_KAPITALOWA_ID', 'PER_ID'])['VALUE'].sum()-\
fakty[(fakty['LINE_ID'] == 25667) &(fakty['DT_GRUPA_KAPITALOWA_ID']!=0)].groupby(['DT_GRUPA_KAPITALOWA_ID', 'PER_ID'])['VALUE'].sum().rolling(6).mean()
marza6 = pd.DataFrame(marza6)
marza6.reset_index(inplace=True)
marza6.head()

   DT_GRUPA_KAPITALOWA_ID  PER_ID  VALUE
0                     202  201201    NaN
1                     202  201202    NaN
2                     202  201203    NaN
3                     202  201204    NaN
4                     202  201205    NaN

In [ ]:
marza6.fillna(0, inplace = True)
marza6['key'] = marza6['PER_ID'].astype(str)+ marza6['DT_GRUPA_KAPITALOWA_ID'].astype(str)
fakty = fakty.merge(marza6[['VALUE', 'key']], on = 'key', how = 'left')
fakty.rename(columns={"VALUE_x": "VALUE", "VALUE_y": "marza6"}, inplace=True)
fakty['marza6'].fillna(0, inplace = True)
fakty.sample(5)

         PER_ID  LINE_ID  ...   marza_3_mies         marza6
553715   201308    25672  ...  276426.666667  318333.333333
106261   201201    25667  ...   -3310.000000   -9408.333333
546639   201206    25668  ...   15516.666667   15313.333333
58661    201509    25666  ...     -56.666667    -278.333333
1045232  201509    25664  ...  474926.666667  548906.666667

[5 rows x 18 columns]

Tworzenie tabeli marza ze średnią ruchomą(z ostatnich 6 miesięcy) po DT_CUST_ID

In [ ]:
marza6_ = fakty[(fakty['LINE_ID']==25672)& (fakty['DT_GRUPA_KAPITALOWA_ID'] ==0)].groupby(['DT_CUST_ID', 'PER_ID'])['VALUE'].sum()-\
fakty[(fakty['LINE_ID'] == 25667) &(fakty['DT_GRUPA_KAPITALOWA_ID']==0)].groupby(['DT_CUST_ID', 'PER_ID'])['VALUE'].sum().rolling(6).mean()
marza6_ = pd.DataFrame(marza6_)
marza6_.reset_index(inplace=True)
marza6_.head()

   DT_CUST_ID  PER_ID  VALUE
0           0  201308    NaN
1        2451  201201    NaN
2       40093  201509    NaN
3       44551  201509    NaN
4       47830  201201    NaN

In [ ]:
marza6_.fillna(0, inplace = True)
marza6_['key_'] = marza6_['PER_ID'].astype(str)+ marza6_['DT_CUST_ID'].astype(str)
fakty = fakty.merge(marza6_[['VALUE', 'key_']], on = 'key_', how = 'left')
fakty.rename(columns={"VALUE_x": "VALUE", "VALUE_y": "marza6_"}, inplace=True)
fakty['marza6_'].fillna(0,inplace = True)
fakty.sample(5)

        PER_ID  LINE_ID  ...        marza6  marza6_
948277  201409    25668  ...      0.000000      0.0
419732  201301    25672  ...   2933.333333      0.0
773360  201205    25667  ...  42206.666667      0.0
341955  201204    25667  ...  18381.666667      0.0
841747  201205    25668  ...    -36.666667      0.0

[5 rows x 19 columns]

In [ ]:
fakty['marza_6_mies'] = fakty['marza6'] + fakty['marza6_']
fakty.drop(['marza6', 'marza6_'], axis = 1, inplace = True)
# Zastąpienie wartośći Szkodowosc_3_mies gdzie brak średniej z 3 okresów poprostu wartościami Szkodowosc
fakty['marza_6_mies'][fakty['marza_6_mies']==0] = fakty[fakty['marza_6_mies']==0]['marza']
fakty.sample(10)

         PER_ID  LINE_ID  ...   marza_3_mies   marza_6_mies
1015847  201308    25666  ...  276426.666667  318333.333333
947146   201407    25666  ...  -64500.000000  -64500.000000
651630   201205    25667  ...   -3460.000000     668.333333
736753   201509    25668  ...   14123.333333   17410.000000
435275   201202    25668  ...   42050.000000   53605.000000
817648   201308    25666  ...    8756.666667   13433.333333
101222   201203    25668  ...    -263.333333     826.666667
441356   201207    25668  ...  210440.000000  210440.000000
97018    201207    25668  ...   24380.000000   24380.000000
49604    201207    25668  ...   22240.000000   22240.000000

[10 rows x 18 columns]

Tworzenie tabeli marza ze średnią ruchomą(z ostatnich 12 miesięcy) po grupie kapitałowej

In [ ]:
marza12 = fakty[(fakty['LINE_ID']==25672)& (fakty['DT_GRUPA_KAPITALOWA_ID'] !=0)].groupby(['DT_GRUPA_KAPITALOWA_ID', 'PER_ID'])['VALUE'].sum()-\
fakty[(fakty['LINE_ID'] == 25667) &(fakty['DT_GRUPA_KAPITALOWA_ID']!=0)].groupby(['DT_GRUPA_KAPITALOWA_ID', 'PER_ID'])['VALUE'].sum().rolling(12).mean()
marza12 = pd.DataFrame(marza12)
marza12.reset_index(inplace=True)
marza12.head()

   DT_GRUPA_KAPITALOWA_ID  PER_ID  VALUE
0                     202  201201    NaN
1                     202  201202    NaN
2                     202  201203    NaN
3                     202  201204    NaN
4                     202  201205    NaN

In [ ]:
marza12.max(), marza12.min()

In [ ]:
marza12.fillna(0, inplace = True)
marza12['key'] = marza12['PER_ID'].astype(str)+ marza12['DT_GRUPA_KAPITALOWA_ID'].astype(str)
fakty = fakty.merge(marza12[['VALUE', 'key']], on = 'key', how = 'left')
fakty.rename(columns={"VALUE_x": "VALUE", "VALUE_y": "marza12"}, inplace=True)
fakty['marza12'].fillna(0, inplace = True)
fakty.sample(5)

        PER_ID  LINE_ID  ...  marza_6_mies        marza12
306553  201202    25668  ...   3465.000000    3845.833333
11886   201201    25667  ...  26925.000000   28812.500000
11374   201201    25672  ...   1440.000000       0.000000
85280   201407    25666  ... -16310.000000       0.000000
706689  201301    25668  ...  72668.333333  102830.833333

[5 rows x 19 columns]

Tworzenie tabeli marza ze średnią ruchomą(z ostatnich 12 miesięcy) po DT_CUST_ID

In [ ]:
marza12_ = fakty[(fakty['LINE_ID']==25672)& (fakty['DT_GRUPA_KAPITALOWA_ID'] ==0)].groupby(['DT_CUST_ID', 'PER_ID'])['VALUE'].sum()-\
fakty[(fakty['LINE_ID'] == 25667) &(fakty['DT_GRUPA_KAPITALOWA_ID']==0)].groupby(['DT_CUST_ID', 'PER_ID'])['VALUE'].sum().rolling(12).mean()
marza12_ = pd.DataFrame(marza12_)
marza12_.reset_index(inplace=True)
marza12_.head()

   DT_CUST_ID  PER_ID  VALUE
0           0  201308    NaN
1        2451  201201    NaN
2       40093  201509    NaN
3       44551  201509    NaN
4       47830  201201    NaN

In [ ]:
marza12_.max(), marza12_.min()

In [ ]:
marza12_.fillna(0, inplace = True)
marza12_['key_'] = marza12_['PER_ID'].astype(str)+ marza12_['DT_CUST_ID'].astype(str)
fakty = fakty.merge(marza12_[['VALUE', 'key_']], on = 'key_', how = 'left')
fakty.rename(columns={"VALUE_x": "VALUE", "VALUE_y": "marza12_"}, inplace=True)
fakty['marza12_'].fillna(0, inplace = True)
fakty.sample(5)

        PER_ID  LINE_ID  ...        marza12  marza12_
167548  201308    25667  ...    1114.166667       0.0
693577  201202    25668  ...  210298.333333       0.0
804379  201407    25668  ...       0.000000       0.0
370893  201301    25667  ...    2035.000000       0.0
793795  201201    25664  ...  292108.333333       0.0

[5 rows x 20 columns]

Finalna tabela ze wszystkimi wskaźnikami

In [ ]:
fakty['marza_12_mies'] = fakty['marza12'] + fakty['marza12_']
fakty.drop(['marza12', 'marza12_'], axis = 1, inplace = True)
# Zastąpienie wartośći marza_12_mies gdzie brak średniej z 12 okresów poprostu wartościami marza
fakty['marza_12_mies'][fakty['marza_12_mies']==0] = fakty[fakty['marza_12_mies']==0]['marza']
fakty.sample(10)

         PER_ID  LINE_ID  ...  marza_6_mies  marza_12_mies
636903   201204    25666  ...  -3010.000000    -136.666667
412000   201204    25668  ...   8455.000000   10551.666667
155700   201208    25668  ...  68760.000000   68760.000000
525128   201207    25668  ...   7380.000000    7380.000000
405420   201509    25667  ...  21145.000000   25059.166667
1008957  201308    25666  ...   2361.666667    1804.166667
709677   201308    25666  ...  75188.333333   88812.500000
852558   201204    25667  ...  18040.000000   18040.000000
599474   201204    25667  ...   -338.333333   -1062.500000
384763   201509    25666  ...   7670.000000   10700.000000

[10 rows x 19 columns]

In [ ]:
fakty.head()

   PER_ID  LINE_ID  ...  marza_6_mies  marza_12_mies
0  201201    25664  ...           0.0            0.0
1  201201    25664  ...           0.0            0.0
2  201202    25664  ...           0.0            0.0
3  201203    25664  ...           0.0            0.0
4  201204    25664  ...           0.0            0.0

[5 rows x 19 columns]

Zapisanie tabeli do csv

In [ ]:
from google.colab import drive
drive.mount('drive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly&response_type=code

Enter your authorization code:
··········
Mounted at drive

In [ ]:
fakty.to_csv('data.csv')
!cp data.csv "drive/My Drive/"

In [ ]:
fakty.head()

   PER_ID  LINE_ID  ...  marza_6_mies  marza_12_mies
0  201201    25664  ...           0.0            0.0
1  201201    25664  ...           0.0            0.0
2  201202    25664  ...           0.0            0.0
3  201203    25664  ...           0.0            0.0
4  201204    25664  ...           0.0            0.0

[5 rows x 19 columns]

Funkcja automatycznie kategoryzująca kontrahenta

In [ ]:
def klasteryzacja(dane):
  #Najpierw warunek jeżeli brak grupy kapitałowej tworzymy klucz po DT_CUST_ID
  if dane['DT_GRUPA_KAPITALOWA_ID'] == 0:
    dane['key_'] = dane['PER_ID'].astype(str)+ dane['DT_CUST_ID'].astype(str)
    #Jeżeli taki sam klucz(PER_ID + DT_CUST_ID) znajduje się w tabeli fakty uzupełniamy danymi z tabeli fakty wartościami
    #gdzie jest ten sam klucz
    if dane['key_'] in fakty['key_']:
      dane['ARPU_3_mies'] == fakty[fakty['key_'] == dane['key_']]['ARPU_3_mies']
      dane['ARPU_6_mies'] == fakty[fakty['key_'] == dane['key_']]['ARPU_6_mies']
      dane['ARPU_12_mies'] == fakty[fakty['key_'] == dane['key_']]['ARPU_12_mies']
      dane['Szkodowosc_3_mies'] == fakty[fakty['key_'] == dane['key_']]['Szkodowosc_3_mies']
      dane['Szkodowosc_6_mies'] == fakty[fakty['key_'] == dane['key_']]['Szkodowosc_6_mies']
      dane['Szkodowosc_12_mies'] == fakty[fakty['key_'] == dane['key_']]['Szkodowosc_12_mies']
      dane['marza_3_mies'] == fakty[fakty['key_'] == dane['key_']]['msarza_3_mies']
      dane['marza_6_mies'] == fakty[fakty['key_'] == dane['key_']]['marza_6_mies']
      dane['marza_12_mies'] == fakty[fakty['key_'] == dane['key_']]['marza_12_mies']
      #Jeżeli nie ma takiego samego klucza w tabeli fakty w takim razie uzupełniam po tym samym DT_CUST_ID
      #i gdzie data = max, ponieważ jeżeli chcę skategoryzować klienta, którego DT_CUST_ID znajduje się w tabeli fakty
      #ale nie ma takiej daty znaczy, że data jest spoźniejszych okresów zatem muszę przypisać wartości gdzie data(PER_ID) = max
    elif (dane['key_'] not in fakty['key_']) & (dane['DT_CUST_ID'] in fakty['DT_CUST_ID']):
      dane['ARPU_3_mies'] == fakty[(fakty['DT_CUST_ID'] == dane['DT_CUST_ID']) & (fakty['DT_GRUPA_KAPITALOWA_ID'] ==0) & (fakty['PER_ID'] == fakty['PER_ID'].max())]['ARPU_3_mies']
      dane['ARPU_6_mies'] == fakty[(fakty['DT_CUST_ID'] == dane['DT_CUST_ID']) & (fakty['DT_GRUPA_KAPITALOWA_ID'] ==0) & (fakty['PER_ID'] == fakty['PER_ID'].max())]['ARPU_6_mies']
      dane['ARPU_12_mies'] == fakty[(fakty['DT_CUST_ID'] == dane['DT_CUST_ID']) & (fakty['DT_GRUPA_KAPITALOWA_ID'] ==0) & (fakty['PER_ID'] == fakty['PER_ID'].max())]['ARPU_12_mies']
      dane['Szkodowosc_3_mies'] == fakty[(fakty['DT_CUST_ID'] == dane['DT_CUST_ID']) & (fakty['DT_GRUPA_KAPITALOWA_ID'] ==0) & (fakty['PER_ID'] == fakty['PER_ID'].max())]['Szkodowosc_3_mies']
      dane['Szkodowosc_6_mies'] == fakty[(fakty['DT_CUST_ID'] == dane['DT_CUST_ID']) & (fakty['DT_GRUPA_KAPITALOWA_ID'] ==0) & (fakty['PER_ID'] == fakty['PER_ID'].max())]['Szkodowosc_6_mies']
      dane['Szkodowosc_12_mies'] == fakty[(fakty['DT_CUST_ID'] == dane['DT_CUST_ID']) & (fakty['DT_GRUPA_KAPITALOWA_ID'] ==0) & (fakty['PER_ID'] == fakty['PER_ID'].max())]['Szkodowosc_12_mies']
      dane['marza_3_mies'] == fakty[(fakty['DT_CUST_ID'] == dane['DT_CUST_ID']) & (fakty['DT_GRUPA_KAPITALOWA_ID'] ==0) & (fakty['PER_ID'] == fakty['PER_ID'].max())]['marza_3_mies']
      dane['marza_6_mies'] == fakty[(fakty['DT_CUST_ID'] == dane['DT_CUST_ID']) & (fakty['DT_GRUPA_KAPITALOWA_ID'] ==0) & (fakty['PER_ID'] == fakty['PER_ID'].max())]['marza_6_mies']
      dane['marza_12_mies'] == fakty[(fakty['DT_CUST_ID'] == dane['DT_CUST_ID']) & (fakty['DT_GRUPA_KAPITALOWA_ID'] ==0) & (fakty['PER_ID'] == fakty['PER_ID'].max())]['marza_12_mies'] 
      #Natomiast gdy brak danego DT_CUST_ID w tabeli fakty nie ma możliwości go skategoryzować
      #Zatem zdeklaruje, że w takiej sytuacji ma się wyświetlić o braku możliwości kategoryzacji klienta
    elif dane['DT_CUST_ID'] not in fakty['DT_CUST_ID'].unique():
      return('Brak wcześniejszych danych dotyczących tego klienta - brak możliwości kategoryzacji')  


      #Kategoryzacja jeżeli istnieje grupa kapitałowa:
  elif dane['DT_GRUPA_KAPITALOWA_ID'] != 0:  
    dane['key'] = dane['PER_ID'].astype(str)+ dane['DT_GRUPA_KAPITALOWA_ID'].astype(str)
    if dane['key_'] in fakty['key_']:
      dane['ARPU_3_mies'] == fakty[fakty['key'] == dane['key']]['ARPU_3_mies']
      dane['ARPU_6_mies'] == fakty[fakty['key'] == dane['key']]['ARPU_6_mies']
      dane['ARPU_12_mies'] == fakty[fakty['key'] == dane['key']]['ARPU_12_mies']
      dane['Szkodowosc_3_mies'] == fakty[fakty['key'] == dane['key']]['Szkodowosc_3_mies']
      dane['Szkodowosc_6_mies'] == fakty[fakty['key'] == dane['key']]['Szkodowosc_6_mies']
      dane['Szkodowosc_12_mies'] == fakty[fakty['key'] == dane['key']]['Szkodowosc_12_mies']
      dane['marza_3_mies'] == fakty[fakty['key'] == dane['key']]['msarza_3_mies']
      dane['marza_6_mies'] == fakty[fakty['key'] == dane['key']]['marza_6_mies']
      dane['marza_12_mies'] == fakty[fakty['key'] == dane['key']]['marza_12_mies']
    #Jeżeli nie ma takiego samego klucza w tabeli fakty w takim razie uzupełniam po tej samej grupie kapitałowej
    #i gdzie data = max, ponieważ jeżeli chcę skategoryzować klienta, którego DT_GRUPA_KAPITALOWA_ID znajduje się w tabeli fakty
    #ale nie ma takiej daty znaczy, że data jest spoźniejszych okresów zatem muszę przypisać wartości gdzie data(PER_ID) = max
    elif (dane['key'] not in fakty['key']) & (dane['DT_GRUPA_KAPITALOWA_ID'] in fakty['DT_GRUPA_KAPITALOWA_ID']):
      dane['ARPU_3_mies'] == fakty[(fakty['DT_GRUPA_KAPITALOWA_ID'] == dane['DT_GRUPA_KAPITALOWA_ID']) & (fakty['DT_GRUPA_KAPITALOWA_ID'] !=0) & (fakty['PER_ID'] == fakty['PER_ID'].max())]['ARPU_3_mies']
      dane['ARPU_6_mies'] == fakty[(fakty['DT_GRUPA_KAPITALOWA_ID'] == dane['DT_GRUPA_KAPITALOWA_ID']) & (fakty['DT_GRUPA_KAPITALOWA_ID'] !=0) & (fakty['PER_ID'] == fakty['PER_ID'].max())]['ARPU_6_mies']
      dane['ARPU_12_mies'] == fakty[(fakty['DT_GRUPA_KAPITALOWA_ID'] == dane['DT_GRUPA_KAPITALOWA_ID']) & (fakty['DT_GRUPA_KAPITALOWA_ID'] !=0) & (fakty['PER_ID'] == fakty['PER_ID'].max())]['ARPU_12_mies']
      dane['Szkodowosc_3_mies'] == fakty[(fakty['DT_GRUPA_KAPITALOWA_ID'] == dane['DT_GRUPA_KAPITALOWA_ID']) & (fakty['DT_GRUPA_KAPITALOWA_ID'] !=0) & (fakty['PER_ID'] == fakty['PER_ID'].max())]['Szkodowosc_3_mies']
      dane['Szkodowosc_6_mies'] == fakty[(fakty['DT_GRUPA_KAPITALOWA_ID'] == dane['DT_GRUPA_KAPITALOWA_ID']) & (fakty['DT_GRUPA_KAPITALOWA_ID'] !=0) & (fakty['PER_ID'] == fakty['PER_ID'].max())]['Szkodowosc_6_mies']
      dane['Szkodowosc_12_mies'] == fakty[(fakty['DT_GRUPA_KAPITALOWA_ID'] == dane['DT_GRUPA_KAPITALOWA_ID']) & (fakty['DT_GRUPA_KAPITALOWA_ID'] !=0) & (fakty['PER_ID'] == fakty['PER_ID'].max())]['Szkodowosc_12_mies']
      dane['marza_3_mies'] == fakty[(fakty['DT_GRUPA_KAPITALOWA_ID'] == dane['DT_GRUPA_KAPITALOWA_ID']) & (fakty['DT_GRUPA_KAPITALOWA_ID'] !=0) & (fakty['PER_ID'] == fakty['PER_ID'].max())]['marza_3_mies']
      dane['marza_6_mies'] == fakty[(fakty['DT_GRUPA_KAPITALOWA_ID'] == dane['DT_GRUPA_KAPITALOWA_ID']) & (fakty['DT_GRUPA_KAPITALOWA_ID'] !=0) & (fakty['PER_ID'] == fakty['PER_ID'].max())]['marza_6_mies']
      dane['marza_12_mies'] == fakty[(fakty['DT_GRUPA_KAPITALOWA_ID'] == dane['DT_GRUPA_KAPITALOWA_ID']) & (fakty['DT_GRUPA_KAPITALOWA_ID'] !=0) & (fakty['PER_ID'] == fakty['PER_ID'].max())]['marza_12_mies']  
    #Natomiast gdy brak danego DT_GRUPA_KAPITALOWA_ID w tabeli fakty nie ma możliwości go skategoryzować
    #Zatem zdeklaruje, że w takiej sytuacji ma się wyświetlić o braku możliwości kategoryzacji klienta
    elif dane['DT_GRUPA_KAPITALOWA_ID'] not in fakty['DT_GRUPA_KAPITALOWA_ID'].unique():
      return('Brak wcześniejszych danych dotyczących tego klienta - brak możliwości kategoryzacji') 
      return(dane)